## Plan for org_account/main
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success`





```terraform
Plan: 4 to add, 0 to change, 0 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_iam_policy.replication will be created
  + resource "aws_iam_policy" "replication" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "ct-cbs-replication-policy"
      + path      = "/"
      + policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "s3:ListBucket",
                          + "s3:GetReplicationConfiguration",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::aws-controltower-logs-274536870005-ca-central-1"
                      + Sid      = ""
                    },
                  + {
                      + Action   = [
                          + "s3:GetObjectVersionTagging",
                          + "s3:GetObjectVersionForReplication",
                          + "s3:GetObjectVersionAcl",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::aws-controltower-logs-274536870005-ca-central-1/*"
                      + Sid      = ""
                    },
                  + {
                      + Action   = [
                          + "s3:ReplicateTags",
                          + "s3:ReplicateObject",
                          + "s3:ReplicateDelete",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::cbs-log-archive-871282759583/*"
                      + Sid      = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id = (known after apply)
      + tags_all  = (known after apply)
    }

  # aws_iam_role.replication will be created
  + resource "aws_iam_role" "replication" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "s3.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "orgCtReplication"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role_policy_attachment.replication will be created
  + resource "aws_iam_role_policy_attachment" "replication" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "orgCtReplication"
    }

  # aws_s3_bucket_replication_configuration.replication will be created
  + resource "aws_s3_bucket_replication_configuration" "replication" {
      + bucket = "aws-controltower-logs-274536870005-ca-central-1"
      + id     = (known after apply)
      + role   = (known after apply)

      + rule {
          + id     = "cbs_cloudtrail_logs"
          + status = "Enabled"

          + destination {
              + account = "871282759583"
              + bucket  = "arn:aws:s3:::cbs-log-archive-871282759583"

              + access_control_translation {
                  + owner = "Destination"
                }

              + encryption_configuration {
                  + replica_kms_key_id = "arn:aws:kms:ca-central-1:871282759583:key/c4591f87-9445-4840-acb6-a5569e703c93"
                }
            }

          + filter {
            }
        }
    }

Plan: 4 to add, 0 to change, 0 to destroy.

Warning: Argument is deprecated

  with module.publishing_bucket.aws_s3_bucket.this,
  on .terraform/modules/publishing_bucket/S3/main.tf line 8, in resource "aws_s3_bucket" "this":
   8: resource "aws_s3_bucket" "this" {

Use the aws_s3_bucket_logging resource instead

(and 16 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.cds_sentinel_securityhub_rule"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.replication"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.replication"]
WARN - plan.json - main - Missing Common Tags: ["aws_kms_key.cds_sentinel_guard_duty_key"]
WARN - plan.json - main - Missing Common Tags: ["aws_sns_topic.critical"]
WARN - plan.json - main - Missing Common Tags: ["aws_sns_topic.warning"]
WARN - plan.json - main - Missing Common Tags: ["module.alarm_actions.aws_cloudwatch_metric_alarm.alarm_failure[\"Ops1\"]"]
WARN - plan.json - main - Missing Common Tags: ["module.alarm_actions.aws_cloudwatch_metric_alarm.alarm_failure[\"Ops2\"]"]
WARN - plan.json - main - Missing Common Tags: ["module.alarm_actions.aws_cloudwatch_metric_alarm.alarm_success[\"Ops1\"]"]
WARN - plan.json - main - Missing Common Tags: ["module.alarm_actions.aws_cloudwatch_metric_alarm.alarm_success[\"Ops2\"]"]
WARN - plan.json - main - Missing Common Tags: ["module.attach_tf_plan_policy.aws_iam_policy.this"]
WARN - plan.json - main - Missing Common Tags: ["module.cloudtrail_forwarder.aws_cloudwatch_log_group.sentinel_forwarder_lambda"]
WARN - plan.json - main - Missing Common Tags: ["module.cloudtrail_forwarder.aws_iam_policy.sentinel_forwarder_lambda"]
WARN - plan.json - main - Missing Common Tags: ["module.cloudtrail_forwarder.aws_iam_policy.sentinel_forwarder_lambda_s3[0]"]
WARN - plan.json - main - Missing Common Tags: ["module.cloudtrail_forwarder.aws_iam_role.sentinel_forwarder_lambda"]
WARN - plan.json - main - Missing Common Tags: ["module.cloudtrail_forwarder.aws_lambda_function.sentinel_forwarder"]
WARN - plan.json - main - Missing Common Tags: ["module.gd_aft_management_detector.aws_guardduty_detector.ca_central_1"]
WARN - plan.json - main - Missing Common Tags: ["module.gd_aft_management_detector.aws_guardduty_detector.us_east_1"]
WARN - plan.json - main - Missing Common Tags:...
```

</details>
